InformationRegisters/СопоставлениеКлассификатораОграниченийСОбъектамиБЭД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СопоставлениеКлассификатораОграниченийСОбъектамиБЭД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗначенияОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСопоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЗначенияОграничения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СопоставлениеКлассификатораОграниченийСОбъектамиБЭД/Ext/RecordSetModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияБЭД.ЭтоУдалениеНабораЗаписей(ЭтотОбъект, Замещение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("Синхронизация") Тогда
		Возврат;
	КонецЕсли;
		
	Если Количество() > 0 Тогда
		ПроверитьНаличиеДублейПоТекущемуНаборуЗаписей(Отказ);
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив; //Массив из Строка
	НепроверяемыеРеквизиты.Добавить("ОбъектСопоставления");
	НепроверяемыеРеквизиты.Добавить("КодОграничения");
	НепроверяемыеРеквизиты.Добавить("КодЗначенияОграничения");
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Не ЗначениеЗаполнено(Запись.КодОграничения) Тогда
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение",
			НСтр("ru = 'Вид документа'"),
			"Запись.ОбъектСопоставления");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "ОбъектСопоставления", "Запись.ОбъектСопоставления", Отказ);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.КодОграничения) Тогда 
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение",
			НСтр("ru = 'Ограничение'"),
			"Запись.НаименованиеОграничения");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "НаименованиеОграничения", 
				"Запись.НаименованиеОграничения", Отказ);
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Запись.КодЗначенияОграничения) Тогда 
			
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле",
			"Заполнение",
			НСтр("ru = 'Значение ограничения'"),
			"Запись.НаименованиеЗначенияОграничения");
			
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "НаименованиеЗначенияОграничения", 
				"Запись.НаименованиеЗначенияОграничения", Отказ);
	
		КонецЕсли;
		
	КонецЦикла; 
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаличиеДублейПоТекущемуНаборуЗаписей(Отказ)
	
	Запрос = Новый Запрос;
	ТаблицаКлючевыхПолей = Выгрузить(,
		"УникальныйИдентификатор, ОбъектСопоставления, КодОграничения, КодЗначенияОграничения");
		
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(Метаданные().ПолноеИмя());
	Менеджер.УстановитьТекстИПараметрыЗапросаПолучитьДублиПоТекущемуНаборуЗаписей(Запрос, ТаблицаКлючевыхПолей);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		
		ОбъектСопоставления = ТаблицаКлючевыхПолей[0].ОбъектСопоставления;
		КодОграничения = ТаблицаКлючевыхПолей[0].КодОграничения;
		КодЗначенияОграничения = ТаблицаКлючевыхПолей[0].КодЗначенияОграничения;
		
		ШаблонСообщения = НСтр("ru = 'Запись с такими ключевыми полями существует! %1, %2, %3.'");
		ТекстСообщения = СтрШаблон(ШаблонСообщения, 
			ОбъектСопоставления, 
			КодОграничения, 
			КодЗначенияОграничения);
			
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
	
	ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
	
#КонецЕсли
